Repository: Foxite/roosterbot
Catalog: RoosterBot.Weather/Resources.*.resx
Languages: nl_nl

# WeatherComponent_HelpText
source: I can look up weather predictions for you and show them in Discord. To do this, use the `{0}weather` command. This command has a few different forms: `{0}weather utrecht` shows the current weather situation in Amsterdam. (`{0}weather now utrecht` or `{0}weather in utrecht` also works.) `{0}weather in 2 hours amsterdam` or `{0}weather on wednesday 15:00 rotterdam`: These examples speak for themselves. `{0}weather in 3 days hilversum` or `{0}weather on wednesday utrecht`: These commands show the weather on the given day, at 08:00, 12:00, and 18:00 hours. Certain towns (Den Bosch and The Hague) have alternative names or spellings. If you find a city of which I don't know the alternative spelling, let the bot owner know about this.
nl_nl: Ik kan weersvoorspellingen voor je opzoeken en in Discord laten zien. Hiervoor gebruik je het `weer` command. Deze command heeft een aantal verschillende vormen: `{0}weer in utrecht` laat de huidige weersomstandigheden in Utrecht zien. (`{0}weer nu utrecht` of `{0}weer utrecht` werkt ook.) `{0}weer over 2 uur amsterdam` of `{0}weer op woensdag 15:00 rotterdam`: Deze voorbeelden spreken voor zich. `{0}weer over 3 dagen hilversum` of `{0}weer op woensdag utrecht`: Deze commands laten het weer zien op de aangegeven dag, om 08:00, 12:00, en 18:00 uur. Enkele steden (Den Bosch en Den Haag) staan bekend onder alternatieve namen of spellingen. Als je een stad tegenkomt waarvan de alternatieve spelling niet bekend is, laat dit weten aan de bot eigenaar.

# WeatherModule_UnitForecast
source: in
nl_nl: over

# WeatherBit_Code_200
source: :cloud_lightning: Thunderstorm with light rain
nl_nl: Onweer met lichte regen

# WeatherBit_Code_201
source: :thunder_cloud_rain: Thunderstorm with rain
nl_nl: Onweer met regen

# WeatherBit_Code_202
source: :thunder_cloud_rain: Thunderstorm with heavy rain
nl_nl: Onweer met zware regen

# WeatherBit_Code_230
source: :cloud_lightning: Thunderstorm with light drizzle
nl_nl: Onweer met lichte motregen

# WeatherBit_Code_231
source: :thunder_cloud_rain: Thunderstorm with drizzle
nl_nl: Onweer met motregen

# WeatherBit_Code_232
source: :thunder_cloud_rain: Thunderstorm with heavy drizzle
nl_nl: Onweer met hevige motregen

# WeatherBit_Code_233
source: :thunder_cloud_rain: Thunderstorm with Hail
nl_nl: Onweer met hagel

# WeatherBit_Code_300
source: :white_sun_rain_cloud: Light Drizzle
nl_nl: Lichte motregen

# WeatherBit_Code_301
source: :cloud_rain: Drizzle
nl_nl: Motregen

# WeatherBit_Code_302
source: :cloud_rain: Heavy Drizzle
nl_nl: Hevige motregen

# WeatherBit_Code_500
source: :white_sun_rain_cloud: Light Rain
nl_nl: Lichte regen

# WeatherBit_Code_501
source: :cloud_rain: Moderate Rain
nl_nl: Regen

# WeatherBit_Code_502
source: :cloud_rain: Heavy Rain
nl_nl: Zware regen

# WeatherBit_Code_511
source: :cloud_rain: Freezing rain
nl_nl: Vriezende regen

# WeatherBit_Code_520
source: :white_sun_rain_cloud: Light shower rain
nl_nl: Lichte buien

# WeatherBit_Code_521
source: :cloud_rain: Shower rain
nl_nl: Buien

# WeatherBit_Code_522
source: :cloud_rain: Heavy shower rain
nl_nl: Hevige buien

# WeatherBit_Code_600
source: :cloud_snow: Light snow
nl_nl: Lichte sneeuw

# WeatherBit_Code_601
source: :cloud_snow: Snow
nl_nl: Sneeuw

# WeatherBit_Code_602
source: :cloud_snow: Heavy Snow
nl_nl: Hevige sneeuw

# WeatherBit_Code_610
source: :cloud_snow: Mix snow/rain
nl_nl: Sneeuw en regen

# WeatherBit_Code_611
source: :snowflake: Sleet
nl_nl: Ijzel

# WeatherBit_Code_612
source: :snowflake: Heavy sleet
nl_nl: Hevige ijzel

# WeatherBit_Code_621
source: :cloud_snow: Snow shower
nl_nl: Sneeuwbuien

# WeatherBit_Code_622
source: :cloud_snow: Heavy snow shower
nl_nl: Zware sneeuwbuien

# WeatherBit_Code_623
source: :cloud_snow: Flurries
nl_nl: Sneeuwvlagen

# WeatherBit_Code_700
source: :foggy: Mist
nl_nl: Mist

# WeatherBit_Code_711
source: :warning: Smoke
nl_nl: Rook

# WeatherBit_Code_721
source: :foggy: Haze
nl_nl: Nevel

# WeatherBit_Code_731
source: :warning: Sand/dust
nl_nl: Zand/stof

# WeatherBit_Code_741
source: :foggy: Fog
nl_nl: Mist

# WeatherBit_Code_751
source: :foggy: Freezing Fog
nl_nl: Vriezende mist

# WeatherBit_Code_800
source: :sunny: Clear sky
nl_nl: Klare lucht

# WeatherBit_Code_801
source: :white_sun_small_cloud: Few clouds
nl_nl: Enkele wolken

# WeatherBit_Code_802
source: :white_sun_small_cloud: Scattered clouds
nl_nl: Licht bewolkt

# WeatherBit_Code_803
source: :white_sun_cloud: Broken clouds
nl_nl: Overwegend bewolkt

# WeatherBit_Code_804
source: :cloud: Overcast clouds
nl_nl: Bewolkt

# WeatherBit_Code_900
source: <:unknown:636213624460935188> Unknown
nl_nl: Onbekend

# WeatherBit_Code_Unknown
source: Congratulations, you are eligible for a free Mars bar. Please contact the bot owner. Error code
nl_nl: Gefeliciteerd, je krijgt een gratis Mars-reep van de bot eigenaar. Foutcode

# WeatherInfo_Present_ApparentTemperature
source: (feels like {0})
nl_nl: (voelt als {0})

# WeatherInfo_Present_NoWind
source: :wind_blowing_face: No wind
nl_nl: Geen wind

# WeatherInfo_Present_Wind
source: :wind_blowing_face: {0} wind {1}
nl_nl: {0} vanuit {1}

# WeatherModule_DayForecast_PretextCity
source: {0}: Weather {1}\n
nl_nl: {0}: Weer {1}\n

# WeatherModule_DayForecast_PretextRegion
source: {0}, {1}: Weather {2}\n
nl_nl: {0}, {1}: Weer {2}\n

# WeatherModule_Group
source: weather
nl_nl: weer

# WeatherModule_Name
source: weather
nl_nl: weer

# WeatherModule_NoLookBack
source: I can't look back.
nl_nl: Ik kan niet terug kijken.

# WeatherModule_SevenDayLimit
source: I can't predict the weather beyond 7 days.
nl_nl: Ik kan het weer niet verder dan 7 dagen voorspellen.

# WeatherModule_Unit_Days
source: day|days
nl_nl: dag|dagen

# WeatherModule_Unit_Hours
source: hour|hours
nl_nl: uur

# WeatherModule_UnknownUnit
source: I can only predict the weather per hour or per day.
nl_nl: Ik kan alleen op uur- of dagniveau het weer voorspellen.

# WeatherComponent_HelpName
source: weather
nl_nl: weer

# WeatherComponent_Attribution
source: Information is provided by WeatherBit.
nl_nl: Informatie wordt verstrekt door WeatherBit.

# CityInfoReader_ParseFailed
source: I don't know that city. Did you mean a city that has a different official name? Tell the bot owner about this.
nl_nl: Die stad ken ik niet. Bedoelde je een stad die officiëel een andere naam heeft? Geef het door aan de bot eigenaar.

# CityInfo_TypeDisplayName
source: town
nl_nl: stad
