Repository: Foxite/roosterbot
Catalog: RoosterBot.Schedule/Resources.*.resx
Languages: nl_nl

# ScheduleComponent_HelpText_Rooster
source: You can query the schedule for a class, teacher or room. You don't have to indicate which you mean; I will pick up on this automatically. You can use these commands to see this: `{0}now`, `{0}next`, `{0}today`, `{0}tomorrow`, `{0}this week`, `{0}next week` After your command, include what you want to know about. If you want to see where 2GD1 is right now, you do this: `{0}now 2gd1` You can also view day or week level. With `{0}day tuesday a223` you can see what is scheduled on wednesday in room A2.23. With `{0}in 2 weeks lance krasniqi` you can see the schedule for Lance Krasniqi, for that entire week. `{0}in` supports hours, days, and weeks. `{0}in 2 hours a127`, `{0}in 3 days 4ga1`, `{0}in 1 week joram` You can also see what is scheduled after the last item you viewed. Use `{0}after` for this. Lastly, you can tell me what class you are in, so you won't have to tell me in every command. Use `{0}help your class` for more information. Better yet: if I know what class a person is in, you can mention that person in my commands. Keep in mind that person gets a ping when you do this.
nl_nl: Je kunt opvragen welke les een klas of leraar heeft, of nu in een lokaal bezig is. Je hoeft niet aan te geven of je een klas, leraar of lokaal bedoelt; ik begrijp dit automatisch. Je kunt deze commands gebruiken om dit te zien: `{0}nu`, `{0}hierna`, `{0}vandaag`, `{0}morgen`, `{0}deze week`, `{0}volgende week` Hierbij vul je na de command in wat je wilt zien. Als je bijvoorbeeld wilt zien welke les 2GD1 nu heeft, doe je dit: `{0}nu 2gd1` Je kunt ook op dag- of weekniveau kijken. Met `{0}dag woensdag a223` kun je bekijken welke lessen er op aanstaande woensdag in lokaal A2.23 zijn. Met `{0}over 2 weken martijn kunstman` zie je het rooster van Martijn Kunstman, voor die hele week. `{0}over` ondersteunt uren, dagen, en weken. `{0}over 2 uur a127`, `{0}over 3 dagen 4ga1`, `{0}over 1 week lance` Verder kun je zien wat er op het rooster staat na het laatste item wat je hebt bekeken. Gebruik hiervoor `{0}daarna`. Ten slotte kun je ook instellen in welke klas jij zit, zodat je niet je eigen klas in hoeft te vullen. Gebruik `{0}help jouw klas` voor meer informatie. Sterker nog: als ik weet in welke klas een persoon zit, kun je die persoon mentionen in mijn commands. Hou er rekening mee dat die persoon een ping krijgt als je dit doet.

# ScheduleComponent_HelpText_Class
source: I can remember in what class you are, so you won't have to tell me every time. To set your class: `{0}me <class>`, for example `{0}me 2gd1`. After that you won't have to put your class in commands. So you can just type `{0}now` and I will know what to search for. You can always check what class I think you're in by just typing `{0}me`, to check if it's still correct (or if you're suffering from amnesia, but I don't think that's the case.)
nl_nl: Ik kan onthouden in welke klas jij zit, zodat je dit niet elke keer er bij hoeft te zetten. Stel je klas in met: `{0}ik <klas>`, bijvoorbeeld `{0}ik 2gd1`. Daarna hoef je niet meer je klas in commands te zetten. Je kan dus alleen maar `{0}nu` typen en dan weet ik wat ik moet opzoeken. Je kan altijd kijken in welke klas ik denk dat je zit door alleen `{0}ik` te typen, om te checken of het nog klopt (of als je aan geheugenverlies lijdt, maar dat denk ik niet.) Dit werkt ook met taalcommando's: `@RoosterBot wat heb ik nu?`

# TeacherInfoReader_CheckFailed
source: Is that a teacher? :thinking: If they are new, they need to be added by the bot owner.
nl_nl: Is dat wel een leraar? :thinking: Als hij of zij nieuw is, moet hij worden toegevoegd door de bot eigenaar.

# StudentSetInfoReader_CheckFailed_Direct
source: Thats not a class.
nl_nl: Dat is geen klas.

# StudentSetInfoReader_CheckFailed_MentionUser
source: I don't know in what class that person is. He/she needs to use `{0}me <his/her class>` to change this.
nl_nl: Ik weet niet in welke klas die persoon zit. Hij/zij moet `{0}ik <zijn/haar klas>` gebruiken om dit in te stellen.

# StudentSetInfoReader_CheckFailed_MentionSelf
source: I don't know in what class you are. Use `{0}me <your class>` to change this.
nl_nl: Ik weet niet in welke klas jij zit. Gebruik `{0}ik <jouw klas>` om dit in te stellen.

# ScheduleModule_GetAfterCommand_ParameterHint
source: Hint: To use `{0}next`, you don't need to specify parameters.
nl_nl: Hint: om `{0}daarna` te gebruiken hoef je geen parameters mee te geven.

# ScheduleModule_GetAfterCommand_NoContext
source: After what?
nl_nl: Na wat?

# ScheduleModule_GetAfterCommand_RecordsOutdated
source: I don't have access to the latest schedule tables, so I can't see anything.
nl_nl: Daarna heb ik nog geen toegang tot de laatste roostertabellen, dus ik kan niets zien.

# ScheduleModule_PretextNext
source: {0}: Next
nl_nl: {0}: Hierna

# ScheduleModule_PretextAfterPrevious
source: {0}: After previous class
nl_nl: {0}: Na de vorige les

# ScheduleModule_ReplyErrorMessage_UnknownIdentifier
source: I don't understand if you're talking about a class, teacher, or room.
nl_nl: Ik weet niet of je het over een leraar, klas of lokaal hebt.

# ScheduleModule_ItIsWeekend
source: It is weekend after all.
nl_nl: Het is dan ook weekend.

# ScheduleModule_Pretext_FirstOn
source: {0}: First on {1}
nl_nl: {0}: Als eerste op {1}

# ScheduleModule_HandleError_NotFound
source: That item is not on my schedules.
nl_nl: Dat item staat niet op mijn rooster.

# ScheduleModule_HandleError_RecordsOutdated
source: I found that item on my schedules, but there is nothing on the schedule yet for that moment.
nl_nl: Ik heb dat item gevonden in mijn rooster, maar er staat nog niets op het rooster op dat moment.

# ScheduleModule_HandleError_NoSchedulesAvailableForServer
source: There are no schedules available for this server.
nl_nl: Er zijn geen roosters beschikbaar voor deze server.

# ScheduleModule_PretextNow
source: {0}: Now
nl_nl: {0}: Nu

# ScheduleModule_InXHours
source: {0}: In {1} hours
nl_nl: {0}: Over {1} uur

# ScheduleModuleBase_ShowFutureCommand_NoRecordAtThatTime
source: There is nothing at that time.
nl_nl: Er is op dat moment niets.

# ScheduleModuleBase_ShowFutureCommand_OnlySupportUnits
source: I only support hours, days, and weeks.
nl_nl: Ik ondersteun alleen uren, dagen, en weken.

# ScheduleModule_RespondDay_NoRecordAtRelative
source: {1}: Not on schedule {0}.
nl_nl: {0}: Niet op het rooster {1}.

# ScheduleModuleBase_RespondDay_ColumnActivity
source: Activity
nl_nl: Activiteit

# ScheduleModuleBase_RespondDay_ColumnTime
source: Time
nl_nl: Tijd

# ScheduleModuleBase_RespondDay_ColumnTeacher
source: Teacher
nl_nl: Leraar

# ScheduleModuleBase_RespondDay_ColumnRoom
source: Room
nl_nl: Lokaal

# ScheduleModule_ResondDay_ScheduleForRelative
source: {0}: Schedule for {1}
nl_nl: {0}: Rooster voor {1}

# ScheduleModule_CurrentCommand_NoCurrentRecord
source: {0}: Not on schedule right now
nl_nl: {0}: Niet op het rooster op dit moment

# ScheduleModuleBase_ThatIsWeekend
source: That is in the weekend after all.
nl_nl: Dat is dan ook weekend.

# ScheduleModuleBase_RespondWeek_ScheduleNextWeek
source: {0}: Schedule for next week
nl_nl: {0}: Rooster volgende week

# ScheduleModuleBase_RespondWeek_ScheduleInXWeeks
source: {0}: Schedule in {1} weeks
nl_nl: {0}: Rooster over {1} weken

# UserClassModule_GetClassForUser_UserNotKnown
source: I don't know in what class you are.
nl_nl: Ik weet niet in welke klas jij zit.

# UserClassModule_GetClassForUser_UserIsInClass
source: You are in {0}.
nl_nl: Jij zit in {0}.

# UserClassModule_GetClassForUser_ChangeHint
source: Use `{0}me <your class>` to change this.
nl_nl: Gebruik `{0}ik <jouw klas>` om dit te veranderen.

# UserClassModule_SetClassForUser_ConfirmUserIsInClass
source: Noted: you are in {0}.
nl_nl: Genoteerd: jij zit in {0}.

# UserClassModule_SetClassForUser_ConfirmUserIsInClassWithOld
source: Noted: you are in {0}, and not in {1} anymore.
nl_nl: Genoteerd: jij zit in {0}, en niet meer in {1}.

# UserClassModule_SetClassForUser_InvalidClass
source: That's not a class.
nl_nl: Dat is geen klas.

# TeacherListModule_TeacherListCommand_NoTeachersFound
source: No teachers found.
nl_nl: Geen leraren gevonden.

# TeacherListModule_TeacherListCommand_ColumnFullName
source: Full name
nl_nl: Volledige naam

# TeacherListModule_TeacherListCommand_ColumnAbbreviation
source: Abbr
nl_nl: Afk.

# TeacherListModule_TeacherListCommand_DiscordName
source: Discord name
nl_nl: Discord naam

# ScheduleModule_Remarks
source: You can use `{0}me` to tell me what class you are in, so you don't have to tell me every time.
nl_nl: Met `{0}ik` kun je instellen in welke klas jij zit, zodat je hier niets hoeft in te vullen.

# ScheduleModule_Summary
source: Automatically understands if you're talking about a class, teacher, or room.
nl_nl: Begrijpt automatisch of je een klas, leraar, of lokaal bedoelt.

# ScheduleModule_Name
source: Schedule
nl_nl: Rooster

# ScheduleModule_DefaultCurrentCommand_Summary
source: See the current schedule item.
nl_nl: Kijk wat er nu op het rooster staat.

# ScheduleModule_DefaultNextCommand_Summary
source: See the next schedule item.
nl_nl: Kijk wat er hierna op het rooster staat

# ScheduleModule_DefaultWeekdayCommand_Summary
source: The schedule for a certain day. If you use today, then I will show you next week. `{0}today` does not do this.
nl_nl: Het rooster voor een bepaalde dag. Als je de huidige dag gebruikt, pak ik volgende week. `{0}vandaag` doet dit niet.

# ScheduleModule_DefaultTomorrowCommand_Summary
source: See the schedule for tomorrow.
nl_nl: Wat er morgen op het rooster staat.

# ScheduleModule_DefaultTodayCommand_Summary
source: See the schedule for today.
nl_nl: Wat er vandaag op het rooster staat.

# TeacherListModule_Name
source: Teachers
nl_nl: Leraren

# TeacherListModule_TeacherListCommand_Summary
source: A list of all teachers, their abbreviations, and their Discord names (if known). You can filter by name.
nl_nl: Een lijst van alle leraren, hun afkortingen, en hun Discord namen (als die bekend is). Je kan filteren op naam.

# UserClassModule_Summary
source: With these commands, you can set what class you are in, so you won't have to enter it in Schedule commands.
nl_nl: Met deze commands kun je instellen in welke klas je zit, zodat je bij Rooster commands niets hoeft in te vullen.

# UserClassModule_GetClassForUser_Summary
source: See what class you are in, according to my records.
nl_nl: Kijk in welke klas jij zit, volgens mijn gegevens.

# UserClassModule_SetClassForUser_Summary
source: Change what class you are in.
nl_nl: Stel in in welke klas jij zit.

# UserClassModule_SetClassForUser_class_Name
source: your class
nl_nl: jouw klas

# ScheduleModule_AfterCommand_Summary
source: See what happens after the last thing you looked up.
nl_nl: Kijk wat er gebeurt na het laatste wat je hebt bekeken.

# ScheduleModuleBase_ShowNextWeekWorkingDays_Summary
source: See when a class or teacher is present next week, or when a room is in use.
nl_nl: Kijk op welke dagen in volgende week een klas of leraar aanwezig is, of een lokaal in gebruik is.

# ScheduleModuleBase_ShowNWeeksWorkingDays_Summary
source: See when a class or teacher is present in *x* weeks, or when a room is in use.
nl_nl: Kijk op welke dagen over *x* weken een klas of leraar aanwezig is, of een lokaal in gebruik is.

# ScheduleModuleBase_ShowThisWeekWorkingDays_Summary
source: See on what days a class or teacher is present, or when a room is in use.
nl_nl: Kijk op welke dagen een klas of leraar aanwezig is, of een lokaal in gebruik is.

# UserClassModule_Name
source: Your class
nl_nl: Jouw klas

# IdentifierInfoReaderBase_ErrorMessage
source: That does not match anything.
nl_nl: Ik weet niet of dat een klas, leraar of lokaal is.

# ScheduleModuleBase_RespondDay_ColumnStudentSets
source: Class
nl_nl: Klas

# ScheduleModule_RespondWorkingDays_NotOnScheduleThisWeek
source: {0}: Not on schedule this week
nl_nl: {0}: Niet op het rooster deze week

# ScheduleModule_RespondWorkingDays_NotOnScheduleNextWeek
source: {0}: Not on schedule next week
nl_nl: {0}: Niet op het rooster volgende week

# ScheduleModule_RespondWorkingDays_NotOnScheduleInXWeeks
source: {0}: Not on schedule in {1} weeks
nl_nl: {0}: Niet op het rooster over {1} weken

# ScheduleModule_RespondDay_OnlyRecordForDay
source: {0}: Only item for {1}
nl_nl: {0}: Enige item voor {1}

# IdentifierInfoReader_Self
source: me
nl_nl: ik

# ScheduleModule_ShowFutureCommand_UnitDays
source: day|days
nl_nl: dag|dagen

# ScheduleModule_ShowFutureCommand_UnitHours
source: hour|hours
nl_nl: uur

# ScheduleModule_ShowFutureCommand_UnitParameterName
source: unit (hours, days, or weeks)
nl_nl: eenheid (uur, dagen, of weken)

# ScheduleModule_ShowFutureCommand_UnitWeeks
source: week|weeks
nl_nl: week|weken

# TeacherListModule_ListCommand_NameParameterName
source: name
nl_nl: naam

# TeacherListModule_TeacherListCommand_TooManyResults
source: Too many results. Please refine your search.
nl_nl: Te veel resultaten. Voeg een specifieker filter toe.

# ScheduleModule_AfterCommand
source: after
nl_nl: daarna

# ScheduleModule_DayCommand
source: day
nl_nl: dag

# ScheduleModule_FutureCommand
source: in
nl_nl: over

# ScheduleModule_NextCommand
source: next
nl_nl: hierna

# ScheduleModule_NextCommand_Aliases
source: later|after this
nl_nl: later|straks|zometeen

# ScheduleModule_NextWeekCommand
source: next week
nl_nl: volgende week

# ScheduleModule_NowCommand
source: now
nl_nl: nu

# ScheduleModule_NowCommand_Aliases
source: schedule
nl_nl: rooster

# ScheduleModule_ThisWeekCommand
source: this week
nl_nl: deze week

# ScheduleModule_TodayCommand
source: today
nl_nl: vandaag

# ScheduleModule_TomorrowCommand
source: tomorrow
nl_nl: morgen

# StudentSetInfoReader_CheckFailed_InaccessibleUser
source: I don't know that user.
nl_nl: Ik ken die gebruiker niet.

# ScheduleModule_ShowFutureCommand_NoRecordAtThatTime
source: There is nothing at that time.
nl_nl: Er is op dat moment niets.

# ScheduleModule_ShowFutureCommand_OnlySupportUnits
source: I only support hours, days, and weeks.
nl_nl: Ik ondersteun alleen uren, dagen, en weken.

# ScheduleModule_RespondDay_ColumnActivity
source: Activity
nl_nl: Activiteit

# ScheduleModule_RespondDay_ColumnTime
source: Time
nl_nl: Tijd

# ScheduleModule_RespondDay_ColumnTeacher
source: Teacher
nl_nl: Leraar

# ScheduleModule_RespondDay_ColumnRoom
source: Room
nl_nl: Lokaal

# ScheduleModule_RespondWeek_ScheduleNextWeek
source: {0}: Schedule for next week
nl_nl: {0}: Rooster volgende week

# ScheduleModule_RespondWeek_ScheduleInXWeeks
source: {0}: Schedule in {1} weeks
nl_nl: {0}: Rooster over {1} weken

# ScheduleModule_ShowNextWeekWorkingDays_Summary
source: See when a class or teacher is present next week, or when a room is in use.
nl_nl: Kijk op welke dagen in volgende week een klas of leraar aanwezig is, of een lokaal in gebruik is.

# ScheduleModule_ShowNWeeksWorkingDays_Summary
source: See when a class or teacher is present in *x* weeks, or when a room is in use.
nl_nl: Kijk op welke dagen over *x* weken een klas of leraar aanwezig is, of een lokaal in gebruik is.

# ScheduleModule_ShowThisWeekWorkingDays_Summary
source: See on what days a class or teacher is present, or when a room is in use.
nl_nl: Kijk op welke dagen een klas of leraar aanwezig is, of een lokaal in gebruik is.

# ScheduleModule_RespondDay_ColumnStudentSets
source: Class
nl_nl: Klas

# ScheduleComponent_HelpName_Class
source: your class
nl_nl: klas

# ScheduleComponent_HelpName_Schedule
source: schedule
nl_nl: rooster

# UserClassModule_SetClassForUser_ConfirmNoChange
source: You're already in {0}!
nl_nl: Je zit al in {0}!
